imashio/STM32F303_MFM/Src/main.c
/*
// logo parameter definition (meidium 'enfini' logo)
#define logo_width        54
#define logo_height       48

static unsigned char logo_bits[] = {
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xF8, 0xFF, 0x0F,
  0x00, 0x00, 0x00, 0xFC, 0xFF, 0xFF, 0xFF, 0x1F, 0x00, 0xE0, 0xFF, 0xFF,
  0xFF, 0xFF, 0xFF, 0x01, 0xF8, 0x3F, 0x00, 0x00, 0xF0, 0xFF, 0x07, 0xF8,
  0x01, 0x00, 0x00, 0x70, 0xE0, 0x0F, 0x7C, 0x00, 0x00, 0x00, 0x70, 0x80,
  0x0F, 0x7C, 0x00, 0x00, 0x00, 0x70, 0x00, 0x07, 0xF8, 0x00, 0x00, 0x00,
  0x38, 0x80, 0x07, 0x00, 0xF8, 0x3F, 0x00, 0x38, 0x80, 0x07, 0x00, 0xFE,
  0xFF, 0x00, 0x1C, 0xC0, 0x03, 0x80, 0xFF, 0xFF, 0x01, 0x0E, 0xC0, 0x01,
  0xC0, 0x07, 0xFC, 0x07, 0x07, 0xE0, 0x01, 0x80, 0x03, 0xF0, 0x9F, 0x03,
  0xF0, 0x00, 0x80, 0x03, 0xC0, 0xFF, 0x03, 0x78, 0x00, 0x00, 0x07, 0x80,
  0xFF, 0x01, 0x3C, 0x00, 0x00, 0x06, 0x00, 0xFE, 0x87, 0x3F, 0x00, 0x00,
  0x0E, 0x00, 0xF8, 0xFF, 0x1F, 0x00, 0x00, 0x1C, 0x00, 0xF8, 0xFF, 0x07,
  0x00, 0x00, 0x38, 0x00, 0xDE, 0xFF, 0x03, 0x00, 0x00, 0x70, 0x00, 0x0F,
  0x7E, 0x00, 0x00, 0x00, 0xE0, 0xC0, 0x07, 0x00, 0x00, 0x00, 0x00, 0xC0,
  0xF1, 0x01, 0x00, 0x00, 0x00, 0x00, 0x80, 0xFF, 0x00, 0x7C, 0x00, 0x00,
  0x00, 0x00, 0x3F, 0x00, 0x3E, 0x00, 0x00, 0x00, 0x00, 0x0E, 0x00, 0x1F,
  0x00, 0x00, 0x00, 0x00, 0x3C, 0x80, 0x0F, 0x00, 0x00, 0x00, 0x00, 0x78,
  0xE0, 0x07, 0x00, 0x00, 0x00, 0x00, 0xE0, 0xFF, 0x03, 0x00, 0x00, 0x00,
  0x00, 0xC0, 0xFF, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x3E, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x30, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x4E, 0x38, 0x00, 0x00, 0x00, 0x00, 0x00, 0x39,
  0x18, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x1C, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x7E, 0x3E, 0xC7, 0x3D, 0x1C, 0x00, 0x00, 0x6F, 0x3E, 0xC7, 0x7F,
  0x1C, 0x00, 0x00, 0x03, 0x1C, 0x86, 0x73, 0x18, 0x00, 0x00, 0x07, 0x1C,
  0x86, 0x71, 0x18, 0x00, 0x00, 0x3E, 0x1C, 0x86, 0x71, 0x18, 0x00, 0x00,
  0x1F, 0x1C, 0x86, 0x71, 0x18, 0x00, 0x00, 0x03, 0x1C, 0x86, 0x71, 0x18,
  0x00, 0x00, 0x47, 0x1C, 0x86, 0x71, 0x18, 0x00, 0x00, 0x7F, 0x3E, 0xCF,
  0xFB, 0x3C, 0x00, 0x00, 0x3C, 0x3E, 0xCF, 0xFB, 0x3C, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  };
*/

u8g2_t    u8g2; // a structure which will contain all the data for one display

uint8_t   update_display = 0;

// uint16_t	rpm = 0;
uint16_t	speed = 240;
uint8_t		gear = 0;
double		MT[5] = {3.483, 2.015, 1.391, 1.000, 0.806};

// UI
uint8_t   mode;
uint8_t   setting;
uint8_t   cursor = 0;

/*
typedef struct {
	unsigned char	name;
	uint8_t			status;
} idct;
*/

// variables for indicators
const unsigned char idct_name[N_idct][5] = { // length must be (text length + 1)
		"CAN"	,
		"O2FB"
};

const uint8_t	idct_status[N_idct] = {
		1	,
		1
};

// variables for measurement
const unsigned char meas_name[N_meas][7] = { // length must be (text length + 1)
		"MAP"         ,
		"OILP"        ,
		"FPV"         ,
		"ECT"         ,
		"OILT"        ,
		"O2"          
};

const unsigned char meas_unit[N_meas][5] = {
		"kpa"			    ,	// MAP
		"kpa"			    ,	// OILP
		"V  "         ,	// FuelPump Voltage
		{176, 67, 0}  ,	// ECT  degC...{176, 67, 0}
		{176, 67, 0}	,	// OILT  degC...{176, 67, 0}
		"V"					    // O2
};

const uint8_t	meas_digit[N_meas] = {
		3	,	// MAP
		3	,	// OILP
		3	,	// FuelPump Voltage
		3	,	// ECT
		3	,	// OILT
		3		// O2
};

const uint8_t	meas_frac[N_meas] = {
		2	,	// MAP
		1	,	// OILP
		1	,	// FuelPump Voltage
		0	,	// ECT
		0	,	// OILT
		2		// O2
};

const uint8_t	meas_sign[N_meas] = {
		1	,	// MAP
		0	,	// OILP
		0	,	// FuelPump Voltage
		0	,	// ECT
		0	,	// OILT
		0		// O2
};

int16_t	meas_value[N_meas] = {
		105	,	// MAP
		235	,	// OILP
		645	,	// FuelPump Voltage
		89	,	// ECT
		73	,	// OILT
		143		// O2
};

// O2 senser Voltage
int16_t   O2_volt = 330;

// Fuel Pump Voltage
int16_t   FP_volt = 330;
int16_t   FP_duty = 100;

// ADXL345 3-axis acceration sensor --------------------------------
uint8_t   Gsens_EN;
uint8_t   Gsens_X1;
uint8_t   Gsens_X0;
int16_t   Gsens_X;
uint8_t   Gsens_Y1;
uint8_t   Gsens_Y0;
int16_t   Gsens_Y;
uint8_t   Gsens_Z1;
uint8_t   Gsens_Z0;
int16_t   Gsens_Z;

#define ADXL0_ADDR 0x1D
// ADXL345     I2C
// SDO/ALT   Address
//    H        0x1D
//    L        0x53

void ADXL345_RegWrite(uint8_t slv_addr, uint8_t addr, uint8_t data){
  uint8_t i2c_buf[2];
  i2c_buf[0] = addr;
  i2c_buf[1] = data;  
  HAL_I2C_Master_Transmit(&hi2c1, slv_addr << 1, &i2c_buf, 2, 10);
}

int8_t ADXL345_RegRead_1byte(uint8_t slv_addr, uint8_t addr){
  uint8_t data;
  HAL_I2C_Master_Transmit(&hi2c1, slv_addr << 1, &addr, 1, 10);
  HAL_I2C_Master_Receive(&hi2c1, slv_addr << 1, &data, 1, 10);
  return data;
}


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
void draw_indicators(){
  uint8_t n;
  uint8_t x, y;
  // draw indicators
  for( n=0; n<N_idct; n++ ){
	  draw_IndicatorBox(&u8g2, idct_x+(idct_width+2)*n, idct_y, idct_width, idct_height, idct_status[n], idct_name[n]);
  }
}

void draw_MeasLabels(){
  uint8_t n;
  uint8_t x, y;
  // draw measurements label & unit
  for( n=0; n<3; n++ ){
	  x = meas_x;
	  y = (n % 3) * meas_height	+ meas_y;
	  draw_MeasLabelUnit(&u8g2, x, y, meas_width1, meas_height, meas_name[n], meas_unit[n]);
  }
  for( n=3; n<N_meas; n++ ){
	  x = meas_width1 + meas_x + meas_x_offset;
	  y = (n % 3) * meas_height	+ meas_y;
	  draw_MeasLabelUnit(&u8g2, x, y, meas_width2, meas_height, meas_name[n], meas_unit[n]);
  }

  // Fuel Pump voltage & duty
  draw_MeasLabelUnit(&u8g2, FP_x, FP_y, FP_duty_width, FP_height, "DUTY", "%  ");
  draw_Value(&u8g2, FP_x, FP_y, FP_duty_width, FP_height, 100, 3, 0, 0, "%  ");
}

void draw_MeasLabels_Rotary(){
  uint8_t n;
  uint8_t x, y;
  // draw measurements label & unit
  for( n=0; n<4; n++ ){
	  x = meas_x;
	  y = (n % 4) * meas_height	+ meas_y;
	  draw_MeasLabelUnit(&u8g2, x, y, meas_width1, meas_height, meas_name[n], meas_unit[n]);
  }
}


// ADC buffer definition
enum{ ADC_BUFFER_LENGTH = 10 };
uint16_t g_ADCBuffer[ADC_BUFFER_LENGTH];
uint16_t adc[ADC_BUFFER_LENGTH];  

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
	for (unsigned int i =0; i<ADC_BUFFER_LENGTH; i++){
	   adc[i] = g_ADCBuffer[i];  // store the values in adc[]
	}
}

