imashio/STM32F303_MFM/Src/main.c
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  uint8_t n;
  uint8_t x, y;

  uint8_t a = 0; // for dummy data
  uint8_t b = 0; // for dummy data

  // ROTARY
  uint16_t rpm_integral;
  uint8_t index_animation;

  // circular buffer for ADC data
  uint16_t circular_buffer_index = 0;
  int16_t circular_buffer[128]={};

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_CAN_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM6_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();

  /* USER CODE BEGIN 2 */

  ///// PWM initialize ----------------------------------------------------------------

  ///// Timer /////
  // TIM1 - PWM for Fuel Pump Driver (Cycle 100kHz = 1MHz / 100count)
  /*
  if (HAL_TIM_Base_Start_IT(&htim1) != HAL_OK)
  {
    Error_Handler();
  }
  */
  // Start Timer1 / ch1
  if (HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }

  // TIM2 - display (Cycle 20ms = 1/100kHz x 2,000count)
  if (HAL_TIM_Base_Start_IT(&htim2) != HAL_OK)
  {
    Error_Handler();
  }

  // TIM3 - Pulse counter for Tacho (f 200kHz, count 65535)
  if (HAL_TIM_Base_Start_IT(&htim3) != HAL_OK)
  {
    Error_Handler();
  }

  // TIM6 - SW interrupt control (Cycle 100ms = 1/100kHz x 10,000count)
  if (HAL_TIM_Base_Start_IT(&htim6) != HAL_OK)
  {
    Error_Handler();
  }

  // ADC
  HAL_ADC_Start_DMA(&hadc1, g_ADCBuffer, ADC_BUFFER_LENGTH);

  // UART1 interrupt setup for DEFI decoder
  HAL_UART_Receive_IT(&huart1, &UART1_Data, 1);
  // variables is defined in 'defi.h'


  // OLED diaplay initialization
  u8g2_Setup_ssd1309_128x64_noname2_f(&u8g2, U8G2_R0, u8x8_byte_4wire_hw_spi, u8x8_gpio_and_delay_STM32F303);  // init u8g2 structure

  // OLED display Reset (must be more than 3us!!)
  HAL_GPIO_WritePin( GPIOB, GPIO_PIN_3, 0); // Set RES=L (OLED Reset)
  HAL_Delay(5);
  HAL_GPIO_WritePin( GPIOB, GPIO_PIN_3, 1); // Set RES=H (OLED activate)
  u8g2_InitDisplay(&u8g2); // send init sequence to the display, display is in sleep mode after this,
  u8g2_SetPowerSave(&u8g2, 0); // wake up display
  u8g2_SetContrast(&u8g2, 255); // set contrast
  u8g2_ClearDisplay(&u8g2);

  // draw opening
  u8g2_DrawXBMP(&u8g2, 40, 0, logo_width, logo_height, logo_bits );

  u8g2_SetFont(&u8g2, u8g2_font_5x7_tf);
  u8g2_DrawStr(&u8g2, 16, 63 - 8, "Multi Function Meter");
  u8g2_DrawStr(&u8g2, 40, 64, "Rev. 0.2a");
  u8g2_SendBuffer(&u8g2);

  HAL_Delay(1000);

  u8g2_ClearBuffer(&u8g2);

  HAL_UART_Transmit_printf(&huart2, "Hello. This is MFM.\n");

  // Set PWM Duty for Timer1 / Output1 (Asymmetric PWM2)
  TIM1->CCR1 = (100 - FP_duty);

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  draw_MeasLabels();
  draw_indicators();
  u8g2_SendBuffer(&u8g2);


  // I2C communication to ADXL345(3-axis G-sensor)

  // DEIVID
  a = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x00);
  HAL_UART_Transmit_printf(&huart2, "ADXL324 DEVID %d\n", a); // debug
  if( a == 0xE5 ){
    Gsens_EN = 1;
  }else{
    Gsens_EN = 0;
  }

  // POWER_CTL
  ADXL345_RegWrite(ADXL0_ADDR, 0x2D, 0x08);
  // bit 3    Measure   1'b1
  a = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x2D); // Check

  // DATA_FORMAT
  ADXL345_RegWrite(ADXL0_ADDR, 0x31, 0x05);
  // bit 2    Justify   1'b1
  // bit 1:0  Range     2'b01
  a = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x31); // Check "POWER_CTL"

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  draw_MeasLabels();
  draw_indicators();
  u8g2_SendBuffer(&u8g2);


  // I2C communication to ADXL345(3-axis G-sensor)

  // DEIVID
  a = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x00);
  HAL_UART_Transmit_printf(&huart2, "ADXL324 DEVID %d\n", a); // debug
  if( a == 0xE5 ){
    Gsens_EN = 1;
  }else{
    Gsens_EN = 0;
  }

  // POWER_CTL
  ADXL345_RegWrite(ADXL0_ADDR, 0x2D, 0x08);
  // bit 3    Measure   1'b1
  a = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x2D); // Check

  // DATA_FORMAT
  ADXL345_RegWrite(ADXL0_ADDR, 0x31, 0x05);
  // bit 2    Justify   1'b1
  // bit 1:0  Range     2'b01
  a = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x31); // Check "POWER_CTL"

  /* USER CODE END 2 */

  while(1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

    ///// ADC ----------------------------------------------------------------

		// read O2 sensor ADC output
//		O2_volt = (int16_t)(330 * (float)g_ADCBuffer[0]/255);
		O2_volt = (int16_t)(330 * (float)adc[0]/255);

		// read Fuel Pump Voltage ADC output
//		FP_volt = (int16_t)((165/33)*33*(float)g_ADCBuffer[1]/255);
		FP_volt = (int16_t)((165/33)*33*(float)adc[1]/255);
    // Ressister attenation ratio '165/33'
    
    ///// Fuel Pump ----------------------------------------------------------------
    // Duty calculation
    if( (rpm >= 3000)|(DEFI_value[0] >= 0) ){
      FP_duty = 100;
    }else{
      FP_duty = (int16_t)(rpm/3000*100);
    }
    // Saturation process
    if( FP_duty > 100 ){
      FP_duty = 100;
    }else if( FP_duty < 60 ){
      FP_duty = 60;
    }

    ///// Measure data  ----------------------------------------------------------------
    defi_decoder(UART1_RxData); // DEFI decoder

    if( flag_meas == 1 ){

      // I2C communication to ADXL345(3-axis G-sensor)
      if( Gsens_EN == 1 ){
        /*
        // Justify = 0
        Gsens_X1 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x33); // Check "DATAX1" (MSB side)
        Gsens_X0 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x32); // Check "DATAX0" (LSB side)
        Gsens_X = (Gsens_X1<<8) | Gsens_X0;
        Gsens_Y1 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x35); // Check "DATAY1" (MSB side)
        Gsens_Y0 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x34); // Check "DATAY0" (LSB side)
        Gsens_Y = (Gsens_Y1<<8) | Gsens_Y0;
        Gsens_Z1 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x37); // Check "DATAZ1" (MSB side)
        Gsens_Z0 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x36); // Check "DATAZ0" (LSB side)
        Gsens_Z = (Gsens_Z1<<8) | Gsens_Z0;
        HAL_UART_Transmit_printf(&huart2, "(%d,%d,%d)\n", Gsens_X, Gsens_Y, Gsens_Z); // debug
        */

        // Justify = 1
        Gsens_X1 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x33); // Check "DATAX1" (MSB side)
        Gsens_Y1 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x35); // Check "DATAY1" (MSB side)
        Gsens_Z1 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x37); // Check "DATAZ1" (MSB side)
        // Acceration 1G = 100
        Gsens_X = 400 * (int8_t)Gsens_X1 / 128; // unsigned->signed & scaling
        Gsens_Y = 400 * (int8_t)Gsens_Y1 / 128; // unsigned->signed & scaling
        Gsens_Z = 400 * (int8_t)Gsens_Z1 / 128; // unsigned->signed & scaling

        HAL_UART_Transmit_printf(&huart2, "(%d,%d,%d)\n", Gsens_X, Gsens_Y, Gsens_Z); // debug
        

