imashio/STM32F303_MFM/Src/main.c
        /*
        ADXL345_G_struct ADXL345_G_data = ADXL345_Read_G(ADXL0_ADDR);
        HAL_UART_Transmit_printf(&huart2, "(%d,%d,%d)\n", ADXL345_G_data.X, ADXL345_G_data.Y, ADXL345_G_data.Z); // debug
        */
      }


/*
  	  // start of create dummy data for debug
      if( rpm <= 8200 ){
          rpm = rpm + (int)(20*MT[gear]);
          //rpm=rpm+10;
      }else{
        if( gear < 4 ){
          gear++;
          rpm = (double)speed / (0.002*60.0) * (MT[gear]*4.1);
        }else{
          gear = 0;
          rpm = 1000;
        }
      }
      speed = (double)rpm*0.002*60.0/MT[gear]/4.1;

      if( a >= 150){
        a = 0;
      }else{
        a++;
      }
  	  // end of create dummy data for debug
*/
      meas_value[0] = DEFI_value[0];  // MAP
		  meas_value[1] = DEFI_value[2];  // OILP
			meas_value[2] = FP_volt;        // FuelPump Voltage
		  meas_value[3] = DEFI_value[6];  // ECT
			meas_value[4] = DEFI_value[5];  // OILT
		  meas_value[5] = O2_volt;        // O2

      flag_meas = 0; // enable again by TIM2 interrupt
    }

    ///// FP driver ----------------------------------------------------------------
    // Set PWM Duty for Timer1 / Output1 (Asymmetric PWM2)
    TIM1->CCR1 = (100 - FP_duty);

    ///// Switch ----------------------------------------------------------------
    if( flag_sw != 0 ){
      switch( flag_sw ){
        case 1:
          HAL_UART_Transmit_printf(&huart2, "UP ");
          HAL_NVIC_DisableIRQ(EXTI9_5_IRQn);
          // SW "UP"
          if( setting == 0 ){
            if( mode == N_mode-1 ){
              mode = 0;
            }else{
              mode++;
            }
          }
          break;
        case 2:
          HAL_UART_Transmit_printf(&huart2, "DOWN ");
          HAL_NVIC_DisableIRQ(EXTI9_5_IRQn);
          // SW "DOWN"
          if( setting == 0 ){
            if( mode == 0 ){
              mode = N_mode-1;
            }else{
              mode--;
            }
          }
          break;
        case 3:
          HAL_UART_Transmit_printf(&huart2, "ENTER ");
          HAL_NVIC_DisableIRQ (EXTI1_IRQn);
          // SW "ENTER"

          // if( setting == 0 ){
          //   mode = cursor;
          //   u8g2_ClearBuffer(&u8g2);
          // }else{
          //   mode = 10;
          // }
          // break;

        default:
          break;
      }
      u8g2_ClearBuffer(&u8g2);
      if( mode == MODE_BAR_METER ){
        draw_MeasLabels();
        draw_indicators();

      }else if( mode == MODE_CIRCULAR_METER ){
        for( n=0; n<N_meas_C; n++ ){
          x = meas_C_x;
          y = n * meas_C_height	+ meas_C_y;
          draw_MeasLabelUnit(&u8g2, x, y, meas_C_width, meas_C_height, meas_name[n], meas_unit[n]);
        }
        // draw indicators
        for( n=0; n<4; n++ ){
          draw_IndicatorBox(&u8g2, idct_x+(idct_width+2)*n, idct_y, idct_width, idct_height, idct_status[n], idct_name[n]);
        }
        draw_CircularMeter_Init(32, 32, 31, 3, -60, 300, 10, 20, -1, -80, 120);
//        draw_CircularMeter_Init(26, 26, 26, 3, -60, 300, 10, 20, -1, -80, 120);
        draw_CircularMeter(&u8g2, 0);
/*
      }else if( mode == MODE_ROTARY ){
        draw_MeasLabels_Rotary();
        draw_MeasLabelUnit(&u8g2, 0, 2, meas_width1, meas_height, "TACHO", "rpm");
*/
      }else if( mode == MODE_SCOPE_MAP ){
        draw_Wave_axis(&u8g2, wave_x, wave_y, wave_width, wave_height, wave_value_min, wave_value_max, 3);
        draw_MeasLabelUnit(&u8g2, 0, 0, 64, 13, "MAP", "kPa");

      }else if( mode == MODE_SCOPE_Gsens ){
        draw_Wave_axis(&u8g2, wave_x, wave_y, wave_width, wave_height, -200, 200, 4);
        draw_MeasLabelUnit(&u8g2, 0, 0, 64, 13, "LatG", "G");

      }
      u8g2_SendBuffer(&u8g2);
      TIM6->CNT = 0;
      flag_sw = 0;
    }

    ///// Display sequence ----------------------------------------------------------------
    if( flag_disp ){

      ///// multi meter /////
      if( mode == MODE_BAR_METER ){
        // update Fuel Pump Voltage
        draw_Value(&u8g2, FP_x, FP_y, FP_duty_width, FP_height, FP_duty, 3, 0, 0, "%  ");

        // draw bar graph
        draw_BarGraph(&u8g2, rpmbar_x, rpmbar_y, rpmbar_width, rpmbar_height, rpm, rpm_min, rpm_max);

        // draw measurement data
        for( n=0; n<3; n++ ){
          x = meas_x;
          y = (n % 3) * meas_height	+ meas_y;
          draw_Value(&u8g2, x, y, meas_width1, meas_height, meas_value[n], meas_digit[n], meas_frac[n], meas_sign[n], meas_unit[n]);
        }
        for( n=3; n<N_meas; n++ ){
          x = meas_width1 + meas_x + meas_x_offset;
          y = (n % 3) * meas_height	+ meas_y;
          draw_Value(&u8g2, x, y, meas_width2, meas_height, meas_value[n], meas_digit[n], meas_frac[n], meas_sign[n], meas_unit[n]);
        }
        
      ///// Circular Meter /////
      }else if( mode == MODE_CIRCULAR_METER ){

        draw_CircularMeter(&u8g2, meas_value[0]);
        
        draw_Value(&u8g2, 36, 33, 30, 16, meas_value[0], 3, 2, 1, "");
        draw_MeasUnit(&u8g2, 38, 40, 28, 16, "kPa");
/*        
        draw_Value(&u8g2, 34, 28, 30, 16, meas_value[0], 3, 2, 1, "");
        draw_MeasUnit(&u8g2, 36, 36, 28, 16, "kPa");
*/

        // draw measurement data
        for( n=0; n<N_meas_C; n++ ){
          x = meas_C_x;
          y = n * meas_C_height	+ meas_C_y;
          draw_Value(&u8g2, x, y, meas_C_width, meas_C_height, meas_value[n], meas_digit[n], meas_frac[n], meas_sign[n], meas_unit[n]);
        }

/*
      }else if( mode == MODE_ROTARY ){

        rpm_integral = rpm_integral + rpm;
        if( rpm_integral > 4000 ){
          rpm_integral = rpm_integral - 4000;
        }
        index_animation = (uint8_t)( (float)rpm_integral / 1000.0 );

        draw_Rotary(&u8g2, 58, 2, index_animation);

        draw_MeasLabelUnit(&u8g2, 0, 2, meas_width1, meas_height, "TACHO", "rpm");
        draw_Value(&u8g2, 0, 2, meas_width1, meas_height, rpm, 4, 0, 0, "rpm");

        draw_MeasLabels_Rotary();
        // draw measurement data
        for( n=0; n<4; n++ ){
          x = meas_x;
          y = (n % 4) * meas_height	+ meas_y;
          draw_Value(&u8g2, x, y, meas_width1, meas_height, meas_value[n], meas_digit[n], meas_frac[n], meas_sign[n], meas_unit[n]);
        }
*/

      ///// Scope /////
      }else if( mode == MODE_SCOPE_MAP ){

